app/views/type_of_cars/index.html.erb

					<td><%= link_to "Editar", edit_type_of_car_path(type_of_car) %></td>
					<% if type_of_car.cars.present? %>
---
SELECT "cars".* FROM "cars" WHERE "cars"."type_of_car_id" = $1  [["type_of_car_id", 2]]