app/views/districts/index.html.erb

SELECT "addresses".* FROM "addresses" WHERE "addresses"."district_id" = $1  [["district_id", 4]]
---
				<td><%= link_to "Editar", edit_district_path(district) %></td>
				<% if district.addresses.present? %>