app/views/absences/edit.html.erb

SELECT  1 AS one FROM "firefighters" INNER JOIN "absences_firefighters" ON "firefighters"."id" = "absences_firefighters"."firefighter_id" WHERE "absences_firefighters"."absence_id" = $1 AND "firefighters"."id" = $2 LIMIT $3  [["absence_id", 3], ["id", 2], ["LIMIT", 1]]
---
                    <label>
                      <%= check_box_tag "firefighters[]", firefighter.id, @absence.firefighters.exists?(firefighter.id) %>

SELECT  1 AS one FROM "cars" INNER JOIN "absences_cars" ON "cars"."id" = "absences_cars"."car_id" WHERE "absences_cars"."absence_id" = $1 AND "cars"."id" = $2 LIMIT $3  [["absence_id", 3], ["id", 1], ["LIMIT", 1]]
---
                    <label>
                      <%= check_box_tag "cars[]", car.id, @absence.cars.exists?(car.id) %>