app/views/absences/show.html.erb

    <h4>Bombeiros envolvidos</h4>
      <% @absence.firefighters.each do |firefighter| %>
---
SELECT "firefighters".* FROM "firefighters" INNER JOIN "absences_firefighters" ON "firefighters"."id" = "absences_firefighters"."firefighter_id" WHERE "absences_firefighters"."absence_id" = $1  [["absence_id", 2]]

    <h4>Veículos envolvidos</h4>
      <% @absence.cars.each do |car| %>
---
SELECT "cars".* FROM "cars" INNER JOIN "absences_cars" ON "cars"."id" = "absences_cars"."car_id" WHERE "absences_cars"."absence_id" = $1  [["absence_id", 2]]