app/controllers/absences_controller.rb

SELECT "absences".* FROM "absences" ORDER BY "absences"."date_out" ASC
---
	def index
		@absences = Absence.order(date_out: :desc).all

SELECT "firefighters".* FROM "firefighters" ORDER BY "firefighters"."name" ASC
SELECT "cars".* FROM "cars" ORDER BY "cars"."name" ASC
---
	def new
		@absence = Absence.new
		@firefighters = Firefighter.order(:name).all
		@cars = Car.order(:name).all

INSERT INTO "absences" ("justification", "exit_time", "return_time", "date_out", "return_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
	def create
    firefighters = Firefighter.where id: params[:firefighters]
    cars = Car.where id: params[:cars]
    @absence = Absence.new(absence_params)

    @absence.firefighters = firefighters
    @absence.cars = cars

    if @absence.save

SELECT  "absences".* FROM "absences" WHERE "absences"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "firefighters".* FROM "firefighters" ORDER BY "firefighters"."name" ASC
SELECT "cars".* FROM "cars" ORDER BY "cars"."name" ASC
---
	def edit
		@absence = Absence.find(params[:id])
    @firefighters = Firefighter.order(:name).all
    @cars = Car.order(:name).all

SELECT  "absences".* FROM "absences" WHERE "absences"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "firefighters".* FROM "firefighters" INNER JOIN "absences_firefighters" ON "firefighters"."id" = "absences_firefighters"."firefighter_id" WHERE "absences_firefighters"."absence_id" = $1  [["absence_id", 3]]
SELECT "cars".* FROM "cars" INNER JOIN "absences_cars" ON "cars"."id" = "absences_cars"."car_id" WHERE "absences_cars"."absence_id" = $1  [["absence_id", 3]]
UPDATE "absences" SET "justification" = $1, "updated_at" = $2 WHERE "absences"."id" = $3  [["justification", "Ausência teste teste 2"], ["updated_at", "2018-04-29 21:32:11.076626"], ["id", 3]]
---
	def update
    @absence = Absence.find(params[:id])

    @firefighters = Firefighter.where id: params[:firefighters]
    @cars = Car.where id: params[:cars]

    @absence.firefighters = @firefighters if @firefighters.present?
    @absence.cars = @cars if @cars.present?

    if @absence.update(absence_params)

SELECT  "absences".* FROM "absences" WHERE "absences"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @absence = Absence.find(params[:id])

SELECT  "absences".* FROM "absences" WHERE "absences"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "absences" WHERE "absences"."id" = $1  [["id", 1]]
---
	def destroy
    @absence = Absence.find(params[:id])
    @absence.destroy