app/controllers/adresses_controller.rb

SELECT "addresses".* FROM "addresses" WHERE "addresses"."district_id" = 2
SELECT  "districts".* FROM "districts" WHERE "districts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def index
  	@adresses = Address.where :district => params[:district_id]
  	@district = District.find(params[:district_id])

SELECT  "districts".* FROM "districts" WHERE "districts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "addresses" ("name", "reference_point", "created_at", "updated_at", "district_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "João Basei Filho"], ["reference_point", ""], ["created_at", "2018-03-22 14:03:37.980513"], ["updated_at", "2018-03-22 14:03:37.980513"], ["district_id", 2]]
---
  def create
  	@district = District.find(params[:district_id])
  	@address = Address.new(address_params)
  	@address.district = @district

  	if @address.save

SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
  def edit
  	@address = Address.find(params[:id])

SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT  "districts".* FROM "districts" WHERE "districts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "addresses" SET "name" = $1, "hydrant" = $2, "updated_at" = $3 WHERE "addresses"."id" = $4  [["name", "Av. Julio de Castilhosss"], ["hydrant", "f"], ["updated_at", "2018-03-27 00:02:54.220308"], ["id", 5]]
---
  def update
  	@address = Address.find(params[:id])
    @district = District.find(params[:district_id])

    if @address.update(address_params)

SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "addresses" WHERE "addresses"."id" = $1  [["id", 2]]
---
  def destroy
    @address = Address.find(params[:id])
    @address.destroy