app/controllers/auth_controller.rb

  def sign_in
  	registration = params[:firefighter][:registration]
  	password = params[:firefighter][:password]
  	firefighter = Firefighter.find_by registration: registration
---
SELECT  "firefighters".* FROM "firefighters" WHERE "firefighters"."registration" = $1 LIMIT $2  [["registration", "777777"], ["LIMIT", 1]]