app/controllers/cars_controller.rb

	def index
		@cars =  Car.where :type_of_car => params[:type_of_car_id]
		@type_of_car = TypeOfCar.find(params[:type_of_car_id])
---
SELECT "cars".* FROM "cars" WHERE "cars"."type_of_car_id" = 2
SELECT  "type_of_cars".* FROM "type_of_cars" WHERE "type_of_cars"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

	def create
		type_of_car = TypeOfCar.find(params[:type_of_car_id])
		@car = Car.new(car_params)
		@car.type_of_car = type_of_car

		if @car.save
---
SELECT  "type_of_cars".* FROM "type_of_cars" WHERE "type_of_cars"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "cars" ("name", "brand", "board", "mileage", "created_at", "updated_at", "type_of_car_id", "year") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

	def edit
		@car = Car.find(params[:id])
---
SELECT  "cars".* FROM "cars" WHERE "cars"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

	def update
		@car = Car.find(params[:id])

		if @car.update(car_params)
---
SELECT  "cars".* FROM "cars" WHERE "cars"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "cars" SET "brand" = $1, "updated_at" = $2 WHERE "cars"."id" = $3  [["brand", "Mercedes-Benz1"], ["updated_at", "2018-03-27 00:05:31.849851"], ["id", 1]]