app/controllers/districts_controller.rb

SELECT "districts".* FROM "districts" ORDER BY "districts"."name" ASC
---
	def index
		 @districts = District.order(:name).all

INSERT INTO "districts" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "São Miguel"], ["created_at", "2018-03-22 14:03:25.535015"], ["updated_at", "2018-03-22 14:03:25.535015"]]
---
	def create
		@district = District.new(district_params)

		if @district.save

SELECT  "districts".* FROM "districts" WHERE "districts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	def edit
		@district = District.find(params[:id])

SELECT  "districts".* FROM "districts" WHERE "districts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "districts" SET "name" = $1, "updated_at" = $2 WHERE "districts"."id" = $3  [["name", "São Miguell"], ["updated_at", "2018-03-22 14:04:50.375622"], ["id", 1]]
---
	def update
		@district = District.find(params[:id])
		if @district.update(district_params)

SELECT  "districts".* FROM "districts" WHERE "districts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "districts" WHERE "districts"."id" = $1  [["id", 1]]
---
	def destroy
		@district = District.find(params[:id])
		@district.destroy