app/controllers/event_logs_controller.rb

SELECT  "occurrence_types".* FROM "occurrence_types" WHERE "occurrence_types"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def index
    #@event_logs = EventLog.order(:date).all
    @event_logs = EventLog.order(date: :desc).where :occurrence_type => params[:type_occurrence_id]
    @type_occurrence = OccurrenceType.find(params[:type_occurrence_id])

SELECT "firefighters".* FROM "firefighters" ORDER BY "firefighters"."name" ASC
SELECT "cars".* FROM "cars" ORDER BY "cars"."name" ASC
SELECT "addresses".* FROM "addresses" ORDER BY "addresses"."name" ASC
---
  def new
    @event_log = EventLog.new
    @firefighters = Firefighter.order(:name).all
    @cars = Car.order(:name).all
    @adresses = Address.order(:name).all

SELECT  "occurrence_types".* FROM "occurrence_types" WHERE "occurrence_types"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
INSERT INTO "cars_event_logs" ("car_id", "event_log_id") VALUES ($1, $2)  [["car_id", 4], ["event_log_id", 1]]
INSERT INTO "event_logs" ("phone", "date", "exit_time", "return_time", "requester", "descriptive_memorial", "measures_taken", "comments", "climate_conditions", "created_at", "updated_at", "occurrence_type_id", "address_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
SELECT "firefighters".* FROM "firefighters" ORDER BY "firefighters"."name" ASC
SELECT "cars".* FROM "cars" ORDER BY "cars"."name" ASC
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."name" IS NULL LIMIT $1  [["LIMIT", 1]]
---
  def create
    firefighters = Firefighter.where id: params[:firefighters]
    cars = Car.where id: params[:cars]
    @type_occurrence = OccurrenceType.find(params[:type_occurrence_id])

    @event_log = EventLog.new(event_log_params)
    @event_log.address = Address.find(params[:event_log][:address]) if params[:event_log][:address].present?
    @event_log.firefighters = firefighters
    @event_log.cars = cars
    @event_log.occurrence_type = @type_occurrence

    if @event_log.save
      redirect_to controller: "event_logs"
      flash[:success] = "Cadastrado com sucesso"
    else
      @firefighters = Firefighter.order(:name).all
      @cars = Car.order(:name).all
      @adresses = Address.order(:name).all