app/controllers/firefighters_controller.rb

SELECT "firefighters".* FROM "firefighters" ORDER BY "firefighters"."name" ASC
---
	def index
		@firefighters = Firefighter.order(:name).all

INSERT INTO "firefighters" ("name", "last_name", "phone", "commandant", "type_blood", "password", "email", "registration", "birth_date", "created_at", "updated_at", "renew_password") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
	def create
		@firefighter = Firefighter.new(firefighter_params)
		@firefighter.password = 12345

		if @firefighter.save

SELECT  "firefighters".* FROM "firefighters" WHERE "firefighters"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
	def show
		@firefighter = Firefighter.find(params[:id])

SELECT  "firefighters".* FROM "firefighters" WHERE "firefighters"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
	def edit
		@firefighter = Firefighter.find(params[:id])

SELECT  "firefighters".* FROM "firefighters" WHERE "firefighters"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "firefighters" SET "password" = $1, "last_name" = $2, "updated_at" = $3 WHERE "firefighters"."id" = $4  [["password", "5994471abb01112afcc18159f6cc74b4f511b99806da59b3caf5a9c173cacfc5"], ["last_name", "Lopes"], ["updated_at", "2018-03-22 18:18:42.411965"], ["id", 3]]
---
	def update
		@firefighter = Firefighter.find(params[:id])

		if @firefighter.update(firefighter_params)

SELECT  "firefighters".* FROM "firefighters" WHERE "firefighters"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "firefighters" WHERE "firefighters"."id" = $1  [["id", 3]]
---
	def destroy
		@firefighter = Firefighter.find(params[:id])
		@firefighter.destroy