app/controllers/pluviometers_controller.rb

	def index
    #cuidar os pontos na ordenacao de data - decrescente desc - crescente asc
		@pluviometers = Pluviometer.order(date: :desc).all
---
SELECT "pluviometers".* FROM "pluviometers" ORDER BY "pluviometers"."date" ASC

	def create
		@pluviometer = Pluviometer.new(pluviometer_params)
		@pluviometer.firefighter = get_firefighter_session

			if @pluviometer.save
---
INSERT INTO "pluviometers" ("last_twenty_four", "last_forty_eight", "date", "note", "created_at", "updated_at", "firefighter_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

	def edit
		@pluviometer = Pluviometer.find(params[:id])
---
SELECT  "pluviometers".* FROM "pluviometers" WHERE "pluviometers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def update
		@pluviometer = Pluviometer.find(params[:id])
		@pluviometer.firefighter = get_firefighter_session

		if @pluviometer.update(pluviometer_params)
---
SELECT  "pluviometers".* FROM "pluviometers" WHERE "pluviometers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "pluviometers" SET "last_forty_eight" = $1, "note" = $2, "updated_at" = $3 WHERE "pluviometers"."id" = $4  [["last_forty_eight", 25.0], ["note", "12312312312"], ["updated_at", "2018-03-31 20:39:12.395293"], ["id", 3]]

	def destroy
		@pluviometer = Pluviometer.find(params[:id])
		@pluviometer.destroy
---
SELECT  "pluviometers".* FROM "pluviometers" WHERE "pluviometers"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "pluviometers" WHERE "pluviometers"."id" = $1  [["id", 3]]