app/controllers/type_occurrences_controller.rb

SELECT "occurrence_types".* FROM "occurrence_types" ORDER BY "occurrence_types"."name" ASC
---
  def index
    @type_occurrences = OccurrenceType.order(:name).all

INSERT INTO "occurrence_types" ("code", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["code", 29], ["name", "Buscas"], ["created_at", "2018-05-10 14:04:00.832142"], ["updated_at", "2018-05-10 14:04:00.832142"]]
---
  def create
    @type_occurrence = OccurrenceType.new(type_occurrence_params)

    if @type_occurrence.save

SELECT  "occurrence_types".* FROM "occurrence_types" WHERE "occurrence_types"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @type_occurrence = OccurrenceType.find(params[:id])

SELECT  "occurrence_types".* FROM "occurrence_types" WHERE "occurrence_types"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "occurrence_types" SET "code" = $1, "updated_at" = $2 WHERE "occurrence_types"."id" = $3  [["code", 0], ["updated_at", "2018-05-10 16:44:03.919688"], ["id", 1]]
---
  def update
    @type_occurrence = OccurrenceType.find(params[:id])

    if @type_occurrence.update(type_occurrence_params)

SELECT  "occurrence_types".* FROM "occurrence_types" WHERE "occurrence_types"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "occurrence_types" WHERE "occurrence_types"."id" = $1  [["id", 4]]
---
  def destroy
    @type_occurrences = OccurrenceType.find(params[:id])
    @type_occurrences.destroy