app/controllers/type_of_cars_controller.rb

	def index
		@type_of_cars = TypeOfCar.order(:name).all
---
SELECT "type_of_cars".* FROM "type_of_cars" ORDER BY "type_of_cars"."name" ASC

	def create
		@type_of_car = TypeOfCar.new(type_of_car_params)

		if @type_of_car.save
---
INSERT INTO "type_of_cars" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Caminhão"], ["created_at", "2018-03-22 14:05:50.726797"], ["updated_at", "2018-03-22 14:05:50.726797"]]

	def edit
		@type_of_car = TypeOfCar.find(params[:id])
---
SELECT  "type_of_cars".* FROM "type_of_cars" WHERE "type_of_cars"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def update
		@type_of_car = TypeOfCar.find(params[:id])

		if @type_of_car.update(type_of_car_params)
---
SELECT  "type_of_cars".* FROM "type_of_cars" WHERE "type_of_cars"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "type_of_cars" SET "name" = $1, "updated_at" = $2 WHERE "type_of_cars"."id" = $3  [["name", "Caminhãoo"], ["updated_at", "2018-03-23 00:40:32.927513"], ["id", 1]]